Update README architecture diagram
